[
    {
        "skillId": 1,
        "skillName": "Beginner Guitar Lessons",
        "providerName": "Alex Martin",
        "providerEmail": "alex@skillswap.com",
        "price": 20,
        "rating": 4.8,
        "slotsAvailable": 3,
        "description": "Learn the basics of playing acoustic guitar from scratch. This course covers essential techniques including strumming patterns, basic chords, tuning, and rhythm exercises. By the end of the sessions, students will be able to play simple songs confidently and understand how to read chord charts and tabs. No prior experience required — perfect for complete beginners who want to start their musical journey.",
        "image": "https://i.ibb.co.com/JRR24q7L/You-Tube-Thumbnail-1280x720-px.jpg",
        "category": "Music"
    },
    {
        "skillId": 2,
        "skillName": "Spoken English Practice",
        "providerName": "Sara Hossain",
        "providerEmail": "sara@skillswap.com",
        "price": 10,
        "rating": 4.6,
        "slotsAvailable": 5,
        "description": "This course is designed to help non-native speakers gain fluency and confidence in English conversation. Students will participate in daily speaking activities, pronunciation correction sessions, and vocabulary-building exercises. Each lesson includes real-world dialogues, group discussions, and communication games to make learning fun and interactive.",
        "image": "https://i.ibb.co.com/JR51ZBvS/18844477-6027334-copy.jpg",
        "category": "Language"
    },
    {
        "skillId": 3,
        "skillName": "Digital Illustration Basics",
        "providerName": "Rafi Ahmed",
        "providerEmail": "rafi@skillswap.com",
        "price": 25,
        "rating": 4.9,
        "slotsAvailable": 4,
        "description": "Discover how to draw and paint digitally using tools like Procreate and Adobe Photoshop. You’ll learn sketching, shading, color theory, and composition to create stunning digital art. This beginner-friendly course guides you step-by-step through the process of building your first illustration portfolio. Ideal for aspiring artists and designers.",
        "image": "https://i.ibb.co.com/RGR6PLhS/maxresdefault.jpg",
        "category": "Design"
    },
    {
        "skillId": 4,
        "skillName": "Photography for Beginners",
        "providerName": "Maya Rahman",
        "providerEmail": "maya@skillswap.com",
        "price": 15,
        "rating": 4.7,
        "slotsAvailable": 6,
        "description": "Unlock the power of your camera and learn how to capture moments beautifully. This course covers exposure, aperture, shutter speed, and composition techniques that will help you take professional-looking photos. You’ll also explore portrait, landscape, and street photography with practical hands-on sessions and feedback.",
        "image": "https://i.ibb.co.com/1YYC7sP1/14328554-5422835-copy.jpg",
        "category": "Photography"
    },
    {
        "skillId": 5,
        "skillName": "Basic Cooking Skills",
        "providerName": "John Walker",
        "providerEmail": "john@skillswap.com",
        "price": 12,
        "rating": 4.5,
        "slotsAvailable": 5,
        "description": "Master the art of simple and delicious cooking at home. This beginner-friendly course teaches knife skills, ingredient preparation, seasoning, and cooking techniques for daily meals. Learn to prepare a variety of dishes from breakfast to dinner while maintaining healthy and balanced nutrition. Ideal for students or anyone new to cooking.",
        "image": "https://i.ibb.co.com/YTk5WLRr/8177791-3847715-copy.jpg",
        "category": "Culinary"
    },
    {
        "skillId": 6,
        "skillName": "Web Development with React",
        "providerName": "Tuhin Mahmud",
        "providerEmail": "tuhin@skillswap.com",
        "price": 40,
        "rating": 5.0,
        "slotsAvailable": 2,
        "description": "This hands-on course will take you from basic HTML and JavaScript knowledge to building complete React web applications. Learn about React components, props, hooks, context API, and integrating APIs. By the end, you’ll be able to build responsive, interactive front-end applications using React and Tailwind CSS — ready to deploy online.",
        "image": "https://i.ibb.co.com/gbRhf3RD/banner-thumbnail.jpg",
        "category": "Programming"
    },
    {
        "skillId": 7,
        "skillName": "Yoga for Beginners",
        "providerName": "Lina Saha",
        "providerEmail": "lina@skillswap.com",
        "price": 8,
        "rating": 4.4,
        "slotsAvailable": 10,
        "description": "Start your wellness journey with yoga sessions focused on flexibility, breathing, and mindfulness. This class includes basic postures (asanas), relaxation techniques, and meditation for mental clarity and physical balance. Suitable for all ages and fitness levels, especially those looking to reduce stress and improve posture.",
        "image": "https://i.ibb.co.com/9kp32bWB/You-Tube-Thumbnail-1280x720-px-1.jpg",
        "category": "Health & Fitness"
    },
    {
        "skillId": 8,
        "skillName": "Public Speaking Confidence",
        "providerName": "David Kim",
        "providerEmail": "david@skillswap.com",
        "price": 18,
        "rating": 4.6,
        "slotsAvailable": 3,
        "description": "Learn to speak confidently in front of any audience. This course covers body language, voice control, storytelling, and structuring persuasive speeches. Through mock presentations and interactive exercises, you’ll overcome stage fear and become a more engaging communicator in professional and social settings.",
        "image": "https://i.ibb.co.com/Dff4tT7C/You-Tube-Thumbnail-1280x720-px-2.jpg",
        "category": "Soft Skills"
    },
    {
        "skillId": 9,
        "skillName": "Creative Writing Workshop",
        "providerName": "Nadia Islam",
        "providerEmail": "nadia@skillswap.com",
        "price": 14,
        "rating": 4.9,
        "slotsAvailable": 4,
        "description": "Discover your unique writing voice through a mix of exercises and feedback sessions. Learn about character development, dialogue writing, and narrative flow. Each week, you’ll write short stories or essays and receive personalized feedback to help you grow as a creative writer and storyteller.",
        "image": "https://i.ibb.co.com/7xRqJf7N/Public-Speaking-Confidence.jpg",
        "category": "Writing"
    },
    {
        "skillId": 10,
        "skillName": "Mobile App UI Design",
        "providerName": "Arif Chowdhury",
        "providerEmail": "arif@skillswap.com",
        "price": 30,
        "rating": 4.8,
        "slotsAvailable": 3,
        "description": "Learn to create beautiful, user-friendly mobile app interfaces using Figma. This course teaches layout grids, typography, color theory, and prototyping. You’ll also learn how to design for both iOS and Android and prepare design assets for developers. Perfect for aspiring UI/UX designers.",
        "image": "https://i.ibb.co.com/Vcrr5VQ8/20828063-6358299-copy.jpg",
        "category": "Design"
    },
    {
        "skillId": 11,
        "skillName": "French Language Basics",
        "providerName": "Clara Dubois",
        "providerEmail": "clara@skillswap.com",
        "price": 16,
        "rating": 4.7,
        "slotsAvailable": 6,
        "description": "Dive into French language fundamentals — from greetings and pronunciation to basic grammar and sentence structure. Classes are interactive, focusing on real-life conversations and cultural nuances to help you speak confidently. Ideal for travelers, students, or professionals preparing for French communication.",
        "image": "https://i.ibb.co.com/gcGQw0B/35308537-8275036-copy.jpg",
        "category": "Language"
    },
    {
        "skillId": 12,
        "skillName": "Video Editing with Premiere Pro",
        "providerName": "Imran Khan",
        "providerEmail": "imran@skillswap.com",
        "price": 35,
        "rating": 4.8,
        "slotsAvailable": 3,
        "description": "Master Adobe Premiere Pro and learn how to edit professional-quality videos for YouTube, social media, or short films. You’ll explore transitions, color correction, audio mixing, and storytelling techniques. This course also covers exporting and rendering for multiple formats and platforms.",
        "image": "https://i.ibb.co.com/RpHgQ3cY/You-Tube-Thumbnail-1280x720-px-3-copy.jpg",
        "category": "Media"
    },
    {
        "skillId": 13,
        "skillName": "Baking & Pastry Art",
        "providerName": "Rima Sen",
        "providerEmail": "rima@skillswap.com",
        "price": 22,
        "rating": 4.5,
        "slotsAvailable": 5,
        "description": "Learn to bake cakes, cookies, and pastries from scratch using professional techniques. This hands-on course includes measuring, mixing, frosting, and decorating methods used by pastry chefs. You’ll also get creative dessert presentation ideas to impress family, friends, or clients.",
        "image": "https://i.ibb.co.com/KcHfTngB/11097205-4564253-copy.jpg",
        "category": "Culinary"
    },
    {
        "skillId": 14,
        "skillName": "Personal Finance Management",
        "providerName": "Omar Ali",
        "providerEmail": "omar@skillswap.com",
        "price": 20,
        "rating": 4.9,
        "slotsAvailable": 2,
        "description": "Take control of your finances with practical lessons on budgeting, saving, and investing. Learn how to manage expenses, build emergency funds, and understand basic investment options like mutual funds and fixed deposits. Perfect for young professionals or anyone looking to improve money habits.",
        "image": "https://i.ibb.co.com/KpJgzSK3/You-Tube-Thumbnail-1280x720-px-4.jpg",
        "category": "Business"
    },
    {
        "skillId": 15,
        "skillName": "Makeup & Beauty Techniques",
        "providerName": "Joya Rahman",
        "providerEmail": "joya@skillswap.com",
        "price": 18,
        "rating": 4.6,
        "slotsAvailable": 7,
        "description": "Learn step-by-step makeup application techniques including foundation blending, contouring, eye makeup, and skincare routines. You’ll also understand face shapes, color matching, and essential tools for both natural and glam looks. Great for beginners or anyone interested in beauty artistry.",
        "image": "https://i.ibb.co.com/45J0Bsc/320952687-11398623-copy.jpg",
        "category": "Lifestyle"
    },
    {
        "skillId": 16,
        "skillName": "Basic Excel for Beginners",
        "providerName": "Rashed Karim",
        "providerEmail": "rashed@skillswap.com",
        "price": 12,
        "rating": 4.7,
        "slotsAvailable": 6,
        "description": "Learn the core features of Microsoft Excel including formulas, data entry, sorting, filtering, and creating charts. This course simplifies spreadsheets for personal or business use, teaching you how to analyze and visualize data effectively. Suitable for office workers, students, and entrepreneurs.",
        "image": "https://i.ibb.co.com/k2d4cyr0/Excel-for-Beginners-BCG-Banner1.png",
        "category": "Productivity"
    },
    {
        "skillId": 17,
        "skillName": "Interior Decoration Ideas",
        "providerName": "Sadia Noor",
        "providerEmail": "sadia@skillswap.com",
        "price": 28,
        "rating": 4.8,
        "slotsAvailable": 4,
        "description": "Transform your home into a stylish, comfortable space. This course teaches you about color theory, furniture arrangement, lighting, and decor planning. You’ll learn how to mix textures and patterns and create mood boards for your dream interior. No professional background required — just creativity!",
        "image": "https://i.ibb.co.com/GQj5yh3t/You-Tube-Thumbnail-1280x720-px-5.jpg",
        "category": "Design"
    },
    {
        "skillId": 18,
        "skillName": "Fitness Training at Home",
        "providerName": "Michael Ray",
        "providerEmail": "michael@skillswap.com",
        "price": 15,
        "rating": 4.5,
        "slotsAvailable": 5,
        "description": "Get fit without going to the gym! Learn bodyweight exercises, core strengthening routines, and flexibility training that can be done at home. The program includes custom plans for different goals like weight loss, muscle toning, and stamina improvement — no equipment required.",
        "image": "https://i.ibb.co.com/N26Yvw0X/You-Tube-Thumbnail-1280x720-px-6.jpg",
        "category": "Health & Fitness"
    },
    {
        "skillId": 19,
        "skillName": "Chess Strategy & Openings",
        "providerName": "Anik Das",
        "providerEmail": "anik@skillswap.com",
        "price": 14,
        "rating": 4.9,
        "slotsAvailable": 3,
        "description": "Enhance your chess performance by mastering key opening strategies and tactical moves. Learn how to control the center, develop pieces effectively, and predict your opponent’s next steps. Includes practice sessions, puzzles, and real-game analysis from tournament experts.",
        "image": "https://i.ibb.co.com/rKNrBBSr/92940841-10097378-copy.jpg",
        "category": "Mind Games"
    },
    {
        "skillId": 20,
        "skillName": "Python Programming Fundamentals",
        "providerName": "Nabil Hasan",
        "providerEmail": "nabil@skillswap.com",
        "price": 35,
        "rating": 5.0,
        "slotsAvailable": 3,
        "description": "A beginner-friendly programming course that introduces Python syntax, loops, data structures, and problem-solving. Learn through real coding projects like calculators, games, and automation scripts. By the end, you’ll be ready to start your journey into data science or web development.",
        "image": "https://i.ibb.co.com/F46gpC2j/IMG-20240916-WA0373.jpg",
        "category": "Programming"
    }
]
